# SetPolyClosed

## Description
Sets the open/closed condition of the referenced poly.

```pascal
PROCEDURE SetPolyClosed(
				polyHandle : HANDLE;
				isClosed   : BOOLEAN);
```

```python

def vs.SetPolyClosed(polyHandle, isClosed):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|polyHandle|HANDLE||
|isClosed|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* Objects - Polys